Repository: regisksc/vgv_challenge
Catalog: lib/presentation/l10n/arb/app_*.arb
Languages: es, fr, pt

# lovelyCoffeePicAppBarTitle
source: Lovely coffee pic
es: Foto de café encantadora
fr: Magnifique photo de café
pt: Foto adorável de café

# alreadyInFavoritesSnackbarMessage
source: this coffee is already in favorites
es: este café ya está en favoritos
fr: ce café est déjà dans les favoris
pt: este café já está nos favoritos

# favoriteCoffeesScreenTitle
source: Favorite coffees
es: Cafés favoritos
fr: Cafés favoris
pt: Cafés favoritos

# lastSeenText
source: Last seen
es: Visto por última vez
fr: Vu pour la dernière fois
pt: Visto por último

# myFavoritesButtonText
source: my favorites
es: mis favoritos
fr: mes favoris
pt: meus favoritos

# trendingCoffeeText
source: Trending coffee
es: Café de tendencia
fr: Café tendance
pt: Café em alta

# newCoffeeText
source: New coffee
es: Café nuevo
fr: Nouveau café
pt: Novo café

# imageNotAvailableText
source: Sorry, we can't bring you coffee at this time
es: Perdón, no podemos le dar café en este momiento
fr: Image non disponible
pt: Imagem não disponível

# ratingFailedSnackbarMessage
source: Rating failed
es: Error al calificar
fr: Échec de l'évaluation
pt: Falha ao avaliar

# commentLabel
source: Comment
es: Comentario
fr: Commentaire
pt: Comentário

# commentHintText
source: Type your comment here
es: Escribe tu comentario aquí
fr: Tapez votre commentaire ici
pt: Digite seu comentário aqui

# noFavoritesYetMessage
source: No favorites yet. Tap on a card, star it and it will appear here.
es: Aún no hay favoritos. Toca una tarjeta, márcala como favorita y aparecerá aquí.
fr: Pas encore de favoris. Appuyez sur une carte, ajoutez-la aux favoris et elle apparaîtra ici.
pt: Sem favoritos ainda. Toque em um card, favorite e ele aparecerá aqui.

# unexpectedErrorMessage
source: Oops... Something went wrong.
es: Oops... Algo salió mal.
fr: Oups... Quelque chose s'est mal passé.
pt: Oops... Algo deu errado.

# noCoffeesFoundMessage
source: No coffees found.
es: No se encontraron cafés.
fr: Aucun café trouvé.
pt: Nenhum café encontrado.

# commentSavedSnackbarMessage
source: Comment saved.
es: Comentario guardado.
fr: Commentaire enregistré.
pt: Comentário salvo.

# commentingFailedSnackbarMessage
source: Commenting failed.
es: Error al comentar.
fr: Échec de la rédaction du commentaire.
pt: Falha ao comentar.

# fileNotAvailableMessage
source: File not available, please load a new one
es: Archivo no disponible, por favor cargue uno nuevo
